Repository: mlq45e/DVRPOdGNULinux_dz2023
Catalog: 11_Documenting(backup2)/po/*/numMagician.po
Languages: ru

source: ...what is Roman Number?
ru: ...-что такое римские число?

source: Be in awe! I'll ask you again, don't say irrelevant things
ru: Будьте аккуратно! Я спрошу тебя еще раз, не говори ненужных вещей

source: I can't include a whole wikipedia page in --help. :)
ru: А что, весь сайт википедия надо? :)

source: I'm a number magician! I know all secret of numbers!
ru: Я волшебник чисел! Я знаю всю тайну чисел!

source: Is that number %d?[y/n]
ru: Oно равно %d?[да->y/нет->n]

source: Is that number %s?[y/n]
ru: Oно равно %s?[да->y/нет->n]

source: It's an interesting programme.
ru: Это интересная программа.

source: It's larger or smaller than %d?[l/s]
ru: Оно больше(l) или меньше(s) %d?[l/s]

source: It's larger or smaller than %s?[l/s]
ru: Оно больше(l) или меньше(s) %s?[l/s]

source: Now please think of an integer between 1 and 100 and tell nobody.
ru: Теперь, пожалуйста, задумайте целое число от 1 по 100 и никому не говорите.

source: Now please think of an integer between I and C and tell nobody.
ru: Теперь, пожалуйста, задумайте целое число от I по C и никому не говорите.

source: Optional: -r to use Roman numbers.
ru: Возможно: -r чтобы смотреть римские числа.

source: See you next time!
ru: Увидимся в следующий раз!

source: So, find out yourselves.
ru: Сами ищите.

source: What is number magician?
ru: Кто такое волшебник чисел?

source: Within %d time! Miraculous me!
ru: Только %d раз! Чудесный я!

source: Within %s time! Miraculous me!
ru: Только %s раз! Чудесный я!

source: You are fooling me! I'm angry! Spell on you!
ru: Ты меня обманываешь! Я зол! Заклинаю на тебе!

source: You can play a number guess game here.
ru: Можно играть гадать число.
